Autodesk.Revit.DB.Structure.AreaLoad.IsCurveLoopsInsideHostBoundaries(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Checks if contour loops is inside host boundaries.
doc:
Document.
hostId:
The id of the analytical element that is about to host a load
loops:
CurveLoops to be checked.
Returns:
Returns true if area load is positioned with entire distribution over the host, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.AreaLoad.SetLoops(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Sets curve loops that define geometry of the area load.
Remarks:
This method works for loads which are not constrained to their host.
This method works with hosted area load only.
All previously defined reference points will be removed.
Curve Loop must be planar and not self-intersecting.
doc:
The document that contains the area load.
newLoops:
Loops that define new geometry of the area load.
The curve loop collection should contains a closed loops consisting of lines.
Returns:
Returns true if successful, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One of the following requirements is not satisfied :
- curve loops newLoops are not planar
- curve loops newLoops  are self-intersecting
- curve loops newLoops contains zero length curves
-or-
Thrown when newLoops collection is empty.
-or-
Thrown when newLoops contains open loop.
-or-
Thrown when newLoops contains a loop consisting of other elements then lines.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AreaLoad is not a hosted load.
-or-
This AreaLoad is a constrained load.
Since:
2016

Autodesk.Revit.DB.Structure.AreaLoad.AreCurveLoopsValid(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Checks if curve loops are valid for creating an area load.
loops:
The curve loops to be checked.
Returns:
Returns true if curve loops are ok, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.AreaLoad.IsValidHostId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates if the provided host id can host area loads
The document containing both the host and the load
The id of the analytical element that is about to host an area load
True if an area load can be placed on the input host id
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AreaLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Int32},System.Collections.Generic.IList{System.Int32},Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new custom area load within the project.
document:
Document to which new area load will be added.
hostElemId:
The analytical surface host element id for the area Load.
loops:
The loops that define geometry of the area load.
The curve loop collection should contains a closed loops consisting of lines.
forceVectors:
The array of force vectors applied to the maximum three reference point of the area load.
refPointCurveIndexes:
The array of maximum three curve indexes on which reference points should be placed on.
refPointCurveEnds:
The array of maximum three curve ends indicating where reference points should be placed on.
The array can have only 0 or 1 values, which means 0 - curve start point, 1 - curve end point.
symbol:
The symbol of the AreaLoad. Set null to use default type.
Returns:
If successful, returns an object of the newly created AreaLoad. null is returned if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
hostElemId is not permitted for this type of load.
-or-
One of the following requirements is not satisfied :
- curve loops loops are not planar
- curve loops loops  are self-intersecting
- curve loops loops contains zero length curves
-or-
Thrown when force vector is equal zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown if the host element id is a Curved Panel.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created area load.
Since:
2024

Autodesk.Revit.DB.Structure.AreaLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new custom area load within the project.
document:
Document to which new area load will be added.
hostElemId:
The analytical surface host element id for the area Load.
loops:
The loops that define geometry of the area load.
The curve loop collection should contains a closed loops consisting of lines.
forceVector:
The force vector applied to the 1st reference point of the area load.
symbol:
The symbol of the AreaLoad. Set null to use default type.
Returns:
If successful, returns an object of the newly created AreaLoad. null is returned if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
hostElemId is not permitted for this type of load.
-or-
One of the following requirements is not satisfied :
- curve loops loops are not planar
- curve loops loops  are self-intersecting
- curve loops loops contains zero length curves
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown if the host element id is a Curved Panel.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created area load.
Since:
2024

Autodesk.Revit.DB.Structure.AreaLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new hosted area load within the project.
document:
Document to which new area load will be added.
hostElemId:
The analytical surface host element id for the area Load.
forceVector:
The force vector applied to the 1st reference point of the area load.
symbol:
The symbol of the AreaLoad. Set null to use default type.
Returns:
If successful, returns an object of the newly created AreaLoad. null is returned if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElemId does not exist in the document
-or-
hostElemId is not permitted for this type of load.
-or-
Thrown when force vector is equal zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created area load.
Since:
2023

Autodesk.Revit.DB.Structure.AreaLoad.ForceVector3
The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting.
Remarks:
The default force unit is kN/m^2 for metric, and ksf for imperial.
Use UnitUtils class methods to convert value from or to internal units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.AreaLoad.ForceVector2
The force vector applied to the 2nd reference point of the area load, oriented according to OrientTo setting.
Remarks:
The default force unit is kN/m^2 for metric, and ksf for imperial.
Use UnitUtils class methods to convert value from or to internal units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.AreaLoad.ForceVector1
The force vector applied to the 1st reference point of the area load, oriented according to OrientTo setting.
Remarks:
The default force unit is kN/m^2 for metric, and ksf for imperial.
Use UnitUtils class methods to convert value from or to internal units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016